app/views/users/show.html.erb

SELECT  "domains".* FROM "domains" WHERE "domains"."id" = ? LIMIT 1  [["id", 1]]
---
  <h6>
  		<%= @user.domain.address %> | <%= @user.domain.city %> | <%= @user.domain.country %> | <%= @user.domain.zip_code %>